#include <stdio.h>
int recursion(int a)
{
    int arr[1023];
    printf("%d ", a);
    recursion(a+1);
}
int main()
{
    int a = 0;
    a = recursion(a);
    return 0;
}

/* Примернр 2000000 Байт 1953 Кбайт 2 Мбайт
     *
     * 62раза * 8192 элем * 4 байт =  2031616 Байт/1984 Кб/ 1.937 Мб
     * 510 * 1000 * 4 = 2040000 Байт/1992.2 Кб
     * 499 * 1024 * 4 = 2043904 Байт/1996 Кб/ 1.949 Мб
     * 487 * 1048 * 4 = 2041504 Байт/1993 Кб
     * 32382 * 2 * 4 = 259056 Байт/252.9 ???
     * 18504 * 16 * 4 = 1184192/1156 Кб/ 1 Мб
     * 3699 * 128 * 4 = 1893888/1849.5 Кб
     * 987 * 512 * 4 = 2021376/1974 Кб
     * 1932 * 256 * 4 = 1978368/1932 Кб
     */